app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('preeti bhosale', 'preeti.bhosale@weboniselab.com', '2018-04-17 12:38:24', '2018-04-17 12:38:24')

  def correct_user
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1